Delans-TLE/src/Enums/ВидыОперацийЗаказПокупателя/ВидыОперацийЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказПокупателя</name>
  <enumValues>
    <name>ЗаказНаПродажу</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаряд</name>
  </enumValues>
  <enumValues>
    <name>ES_ЗаказНаДоставку</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеЗапасов</name>
  <basedOn>Document.ПеремещениеПоЯчейкам</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.СборкаЗапасов</basedOn>
  <basedOn>Document.ПриходныйОрдер</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <registerRecords>AccumulationRegister.ЗапасыВРазрезеГТД</registerRecords>
  <registerRecords>AccumulationRegister.СуммовойУчетВРознице</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКРасходуСоСкладов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКПоступлениюНаСклады</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.СерийныеНомера</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПринятые</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозчика</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьВыдана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.СборкаЗапасов</types>
      <types>DocumentRef.ПеремещениеПоЯчейкам</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.ПриходныйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПечатиСсылка</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщикаОтправил</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщикаПолучил</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКонтролера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЗаказаПокупателя</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтпустил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтпустилДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРуководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРуководительДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецоснастка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнвентарьИХозяйственныеПринадлежности</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/CommonModules/РасчетСтатусовОформленияВЕТИСПереопределяемый/Module.bsl
// Механизм расчета статусов оформления документов ВЕТИС.
//

#Область ПрограммныйИнтерфейс

// Позволяет переопределить имена реквизитов документа-основания для документа ВЕТИС.
//
// Параметры:
//	МетаданныеДокументаОснования - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.Основание<Имя документа ВЕТИС>
//	МетаданныеДокументаВЕТИС 	 - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.ДокументыВЕТИСПоддерживающиеСтатусыОформления
//	Реквизиты 					 - Структура - имена реквизитов
//		Ключ 	 - служебное имя реквизита в ВЕТИС
//		Значение - имя реквизита документа-основания, которое при необходимости надо переопределить
//			Подробнее см. описание РасчетСтатусовОформленияВЕТИС.СтруктураРеквизитовДляРасчетаСтатусаОформленияДокументовВЕТИС	
//
Процедура ПриОпределенииИменРеквизитовДокументаДляРасчетаСтатусаОформленияДокументаВЕТИС(
			Знач МетаданныеДокументаОснования, Знач МетаданныеДокументаВЕТИС, Реквизиты) Экспорт
	
	// Зададим имена реквизитов по умолчанию.
	Реквизиты.Контрагент             			= "Организация";
	Реквизиты.ТорговыйИлиПроизводственныйОбъект = "СтруктурнаяЕдиница";
	
	// Определим имя реквизита "Ответственный".
	Если МетаданныеДокументаОснования.Реквизиты.Найти("Ответственный") <> Неопределено Тогда
		Реквизиты.Ответственный = "Ответственный";
	Иначе
		Реквизиты.Ответственный = "Автор";
	КонецЕсли;
		
	// Уточним имена реквизитов для конкретных документов.
	Если МетаданныеДокументаОснования = Метаданные.Документы.ПеремещениеЗапасов Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИсходящаяТранспортнаяОперацияВЕТИС Тогда
			
			Реквизиты.ТорговыйИлиПроизводственныйОбъект = "СтруктурнаяЕдиница";
			
		ИначеЕсли МетаданныеДокументаВЕТИС = Метаданные.Документы.ВходящаяТранспортнаяОперацияВЕТИС Тогда
			
			Реквизиты.ТорговыйИлиПроизводственныйОбъект = "СтруктурнаяЕдиницаПолучатель";
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ЗаказПокупателя Тогда
		
		Реквизиты.ТорговыйИлиПроизводственныйОбъект = "СтруктурнаяЕдиницаПродажи";
		
	КонецЕсли;
	
КонецПроцедуры

// Позволяет переопределить текст запроса выборки данных из документов-основания для расчета статуса оформления.
//
// Параметры:
//	МетаданныеДокументаОснования - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.Основание<Имя документа ВЕТИС>
//	МетаданныеДокументаВЕТИС 	 - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.ДокументыВЕТИСПоддерживающиеСтатусыОформления
//	ТекстЗапроса 				 - Строка - текст запроса выборки данных, который надо переопределить
//		Требования к тексту запроса:
//		- результат запроса обязательно должен содержать следующие поля:
//			- Ссылка 			- ОпределяемыйТип.Основание<Имя документа ВЕТИС> - ссылка на документ-основание
//			- ЭтоДвижениеПриход - Булево - вид движения ТМЦ (Истина - приход, Ложь - расход)
//			- Номенклатура 		- ОпределяемыйТип.Номенклатура - номенклатура
//			- Характеристика 	- ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика номенклатуры
//			- Серия 			- ОпределяемыйТип.СерияНоменклатуры - серия номенклатуры
//			- Количество 		- Число - количество номенклатуры в ее основной единице измерения
//		- в результат запроса нужно включать только подконтрольную номенклатуру ВЕТИС
//		- для отбора документов-основания в запросе нужно использовать отбор "В (&МассивДокументов)"
//		- выбранные данные необходимо поместить во временную таблицу,
//			см. РасчетСтатусовОформленияВЕТИС.ИмяВременнойТаблицыДляВыборкиДанныхДокумента
//		Если данные из документа выбирать не требуется, то данному параметру надо присвоить значение "" (пустая строка).
//	ДополнительныеПараметрыЗапроса - Структура - дополнительные параметры запроса,
//	 	требуемые для выполнения запроса конкретного документа; при необходимости можно дополнить данную структуру
//		- Ключ 	   - имя параметры
//		- Значение - значение параметра
//
Процедура ПриОпределенииТекстаЗапросаДляРасчетаСтатусаОформленияДокументаВЕТИС(
			Знач МетаданныеДокументаОснования, Знач МетаданныеДокументаВЕТИС, ТекстЗапроса, ДополнительныеПараметрыЗапроса) Экспорт
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.ОприходованиеЗапасов Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИнвентаризацияПродукцииВЕТИС Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ОприходованиеЗапасовЗапасы.Ссылка КАК Ссылка,
			|	ИСТИНА КАК ЭтоДвижениеПриход,
			|	ОприходованиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
			|	ОприходованиеЗапасовЗапасы.Характеристика КАК Характеристика,
			|	ОприходованиеЗапасовЗапасы.Партия КАК Серия,
			|	ОприходованиеЗапасовЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасовЗапасы
			|ГДЕ
			|	ОприходованиеЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И ОприходованиеЗапасовЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС";
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ПеремещениеЗапасов Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ВходящаяТранспортнаяОперацияВЕТИС Тогда
			
			ТекстЗапроса = ""; // не формируем - будет получен через обмен
			
		ИначеЕсли МетаданныеДокументаВЕТИС = Метаданные.Документы.ИсходящаяТранспортнаяОперацияВЕТИС Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоДвижениеПриход,
			|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
			|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
			|	ПеремещениеЗапасовЗапасы.Партия КАК Серия,
			|	ПеремещениеЗапасовЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
			|ГДЕ
			|	ПеремещениеЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И ПеремещениеЗапасовЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС";
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ПересортицаЗапасов Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИнвентаризацияПродукцииВЕТИС Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПересортицаЗапасовЗапасы.Ссылка КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоДвижениеПриход,
			|	ПересортицаЗапасовЗапасы.Номенклатура КАК Номенклатура,
			|	ПересортицаЗапасовЗапасы.Характеристика КАК Характеристика,
			|	ПересортицаЗапасовЗапасы.Партия КАК Серия,
			|	ПересортицаЗапасовЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.ПересортицаЗапасов.Запасы КАК ПересортицаЗапасовЗапасы
			|ГДЕ
			|	ПересортицаЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И ПересортицаЗапасовЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПересортицаЗапасовЗапасы.Ссылка,
			|	ИСТИНА,
			|	ПересортицаЗапасовЗапасы.НоменклатураОприходование,
			|	ПересортицаЗапасовЗапасы.ХарактеристикаОприходование,
			|	ПересортицаЗапасовЗапасы.ПартияОприходование,
			|	ПересортицаЗапасовЗапасы.Количество
			|ИЗ
			|	Документ.ПересортицаЗапасов.Запасы КАК ПересортицаЗапасовЗапасы
			|ГДЕ
			|	ПересортицаЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И ПересортицаЗапасовЗапасы.НоменклатураОприходование.ПодконтрольнаяПродукцияВЕТИС";
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.РасходнаяНакладная Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИсходящаяТранспортнаяОперацияВЕТИС Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоДвижениеПриход,
			|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
			|	РасходнаяНакладнаяЗапасы.Партия КАК Серия,
			|	РасходнаяНакладнаяЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Ссылка В (&МассивДокументов)
			|	И НЕ РасходнаяНакладнаяЗапасы.Ссылка.СпособПродажиГИСМ = ""роз""
			|	И РасходнаяНакладнаяЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС";
			
		КонецЕсли;
		
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ОтчетОПереработке Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИсходящаяТранспортнаяОперацияВЕТИС Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ОтчетОПереработкеПродукция.Ссылка КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоДвижениеПриход,
			|	ОтчетОПереработкеПродукция.Номенклатура КАК Номенклатура,
			|	ОтчетОПереработкеПродукция.Характеристика КАК Характеристика,
			|	ОтчетОПереработкеПродукция.Партия КАК Серия,
			|	ОтчетОПереработкеПродукция.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.ОтчетОПереработке.Продукция КАК ОтчетОПереработкеПродукция
			|ГДЕ
			|	ОтчетОПереработкеПродукция.Ссылка В (&МассивДокументов)
			|	И ОтчетОПереработкеПродукция.Номенклатура.ПодконтрольнаяПродукцияВЕТИС";
			
		КонецЕсли;

	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ЗаказПокупателя Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИсходящаяТранспортнаяОперацияВЕТИС Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоДвижениеПриход,
			|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
			|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
			|	ЗаказПокупателяЗапасы.Партия КАК Серия,
			|	ЗаказПокупателяЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
			|ГДЕ
			|	ЗаказПокупателяЗапасы.Ссылка В (&МассивДокументов)
			|	И ЗаказПокупателяЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС
			|	И ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)";
			
		КонецЕсли;
			
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.СписаниеЗапасов Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ИнвентаризацияПродукцииВЕТИС Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СписаниеЗапасовЗапасы.Ссылка КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоДвижениеПриход,
			|	СписаниеЗапасовЗапасы.Номенклатура КАК Номенклатура,
			|	СписаниеЗапасовЗапасы.Характеристика КАК Характеристика,
			|	СписаниеЗапасовЗапасы.Партия КАК Серия,
			|	СписаниеЗапасовЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.СписаниеЗапасов.Запасы КАК СписаниеЗапасовЗапасы
			|ГДЕ
			|	СписаниеЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И СписаниеЗапасовЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС";
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.СборкаЗапасов Тогда
		
		Если МетаданныеДокументаВЕТИС = Метаданные.Документы.ПроизводственнаяОперацияВЕТИС Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СборкаЗапасовПродукция.Ссылка КАК Ссылка,
			|	ИСТИНА КАК ЭтоДвижениеПриход,
			|	СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
			|	СборкаЗапасовПродукция.Характеристика КАК Характеристика,
			|	СборкаЗапасовПродукция.Партия КАК Серия,
			|	СборкаЗапасовПродукция.Количество КАК Количество
			|ПОМЕСТИТЬ %ВТ%
			|ИЗ
			|	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасовПродукция
			|ГДЕ
			|	СборкаЗапасовПродукция.Ссылка В (&МассивДокументов)
			|	И СборкаЗапасовПродукция.Номенклатура.ПодконтрольнаяПродукцияВЕТИС
			|	И СборкаЗапасовПродукция.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСборкаЗапасов.Сборка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СборкаЗапасовЗапасы.Ссылка,
			|	ЛОЖЬ,
			|	СборкаЗапасовЗапасы.Номенклатура,
			|	СборкаЗапасовЗапасы.Характеристика,
			|	СборкаЗапасовЗапасы.Партия,
			|	СборкаЗапасовЗапасы.Количество
			|ИЗ
			|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
			|ГДЕ
			|	СборкаЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И СборкаЗапасовЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС
			|	И СборкаЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСборкаЗапасов.Сборка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СборкаЗапасовПродукция.Ссылка,
			|	ЛОЖЬ,
			|	СборкаЗапасовПродукция.Номенклатура,
			|	СборкаЗапасовПродукция.Характеристика,
			|	СборкаЗапасовПродукция.Партия,
			|	СборкаЗапасовПродукция.Количество
			|ИЗ
			|	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасовПродукция
			|ГДЕ
			|	СборкаЗапасовПродукция.Ссылка В (&МассивДокументов)
			|	И СборкаЗапасовПродукция.Номенклатура.ПодконтрольнаяПродукцияВЕТИС
			|	И СборкаЗапасовПродукция.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСборкаЗапасов.Разборка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СборкаЗапасовЗапасы.Ссылка,
			|	ИСТИНА,
			|	СборкаЗапасовЗапасы.Номенклатура,
			|	СборкаЗапасовЗапасы.Характеристика,
			|	СборкаЗапасовЗапасы.Партия,
			|	СборкаЗапасовЗапасы.Количество
			|ИЗ
			|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
			|ГДЕ
			|	СборкаЗапасовЗапасы.Ссылка В (&МассивДокументов)
			|	И СборкаЗапасовЗапасы.Номенклатура.ПодконтрольнаяПродукцияВЕТИС
			|	И СборкаЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСборкаЗапасов.Разборка)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяВременнойТаблицы = РасчетСтатусовОформленияВЕТИС.ИмяВременнойТаблицыДляВыборкиДанныхДокумента();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВТ%", ИмяВременнойТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
